
/* Report1_3: 60갑자로 무슨 해인지 출력하는 프로그램
 * 우리나라와 중국 등 동양에서 갑(甲), 을(乙), 병(丙), 정(丁), 무(戊), 기(己), 경(庚), 신(辛), 임(壬), 계(癸)의 십간은 십진수
 * 쥐, 소, 호랑이, 토끼 등 십이지는 자(子), 축(丑), 인(寅), 묘(卯), 진(辰), 사(巳), 오(午), 미(未), 신(申), 유(酉), 술(戌), 해(亥)로 12진수
 * 태어나서 만으로 60세 생일이 되는 해는 자신이 태어난 해와 같은 간지가 되는 해가 된다. 그 해를 갑자를 돌아온다고 하여 환갑(還甲) 또는 회갑(回甲)이라고 한다. 십간 십이지를 조합한 간지는 60진법을 의미한다.

	1924년은 갑자년이다. 
	http://cafe.naver.com/ladybooupmall/71691 
	자신이 태어난 해, 2000년, 그리고 2019년이 무슨 해인지를 출력하시오.
	
 *  실행예
     년도를 입력하시오> 1924
  1924년은 “갑자”년입니다. 

 
 * 이 프로그램은 '10간'과 '12진수'를 사용해 무슨 해인지 출력하는 프로그램이다.
 * 2개의 string 배열을 사용하여 값을 저장한다.
 *  
 *  작성일 :2019년 3월 25일
 *  작성자: 양명철
 */

import java.util.Scanner;

public class Report1_3
{
	public static void main(String args[])
	{
		String gan[] = {"갑", "을", "병", "정", "무", "기", "경", "신", "임", "계"};
		String twelve[] = {"자", "축", "인", "묘", "진", "사", "오", "미", "신", "유", "술", "해"};
		int year, difference;
		
		// 사용자로부터 년도를 입력받는다.
		Scanner input = new Scanner(System.in);
		System.out.print("년도를 입력하시오> ");
		year = input.nextInt();
		
		difference = Math.abs(year - 1984) % 60;
		//결과를 출력한다.
		System.out.print(year + "년은 \"" +  gan[difference % 10] + twelve[difference % 12] + "\"년입니다.");		
	}
}